<script setup>
import { Link, router, usePage } from '@inertiajs/vue3';
import { User, isHome } from '@/view/Composables/GlobalData.js';
import { ref, onBeforeUnmount } from 'vue';

isHome.value = usePage().url === '/';
const isScroll = ref(false);

const handleScroll = () => {
    if(window.scrollY >= 100) {
        isScroll.value = true;
    }else{
        if(window.scrollY < 100) {
            isScroll.value = false;
        }
    }
};

if (isHome.value) {
    handleScroll();
    window.addEventListener('scroll', handleScroll);
}

onBeforeUnmount(() => {
    isScroll.value = false;
    window.removeEventListener('scroll', handleScroll)
})

const headerMenuItems = ref([
    {
        label: 'Направления',
        items: [
            { label: 'Медицина', url: route('main.questions.index', { direction: 1 }) },
            { label: 'Юриспруденция', url: route('main.questions.index', { direction: 2 }) },
            { label: 'Бухгалтерия', url: route('main.questions.index', { direction: 3 }) },
            { label: 'Ветеринария', url: route('main.questions.index', { direction: 4 }) },
            { label: 'Госзаказы', url: route('main.questions.index', { direction: 5 }) },
            { label: 'Другое' },
        ],
    },
    { label: 'Вопросы', url: route('main.questions.index') },
    { label: 'Специалисты', url: route('main.specialists.index') },
    { label: 'Статьи', url: route('main.articles.index') },
]);

const userMenu = ref();
const userMenuItems = ref([]);

userMenuItems.value.push({ label: 'Мой профиль', avatar: true, url: route('user.home.index', [], false), view: true });
userMenuItems.value.push({ label: 'Баланс', icon: 'credit_card', url: route('user.finance.index', [], false), view: true });
if(User.value.roleClient){
    userMenuItems.value.push({ label: 'Мои вопросы', icon: 'question_mark', url: route('user.questions.index', [], false), view: User.value.roleClient });
}
userMenuItems.value.push({ label: 'Консультации', icon: 'shield_question', url: route('user.consultations.index', [], false), view: true });
if(User.value.roleSpecialist){
    userMenuItems.value.push({ label: 'Мои статьи', icon: 'file_copy', url: route('user.articles.index', [], false), view: User.value.roleSpecialist });
}
if(User.value.roleClient){
    userMenuItems.value.push({ label: 'Файлы', icon: 'file_copy', url: route('user.files.index', [], false), view: User.value.roleClient });
}
userMenuItems.value.push({ label: 'Рефералы', icon: 'group_add', url: route('user.referrals.index', [], false), view: true });
if(User.value.roleSpecialist){
    userMenuItems.value.push({ label: 'Рейтинг и отзывы', icon: 'star_rate', url: route('user.reviews.index', [], false), view: User.value.roleSpecialist });
}
if(User.value.roleClient){
    userMenuItems.value.push({ label: 'Отзывы', icon: 'star_rate', url: route('user.reviews.index', [], false), view: User.value.roleClient });
}

const toggleUserMenu = (event) => {
    userMenu.value.toggle(event);
};
</script>

<template>
    <header :class="isHome && !isScroll ? 'headerHome' : ''">
        <div class="main">
            <div class="left">
                <Link :href="route('main.home.index')" class="logo">
                    <svg width="130" height="39" viewBox="0 0 130 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_1089_541)">
                            <path
                                opacity="0.999"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M30.8887 0.496622C30.9959 0.496622 31.1031 0.496622 31.2103 0.496622C32.1192 0.577539 32.8206 0.994132 33.3142 1.7464C33.713 2.42418 33.802 3.14027 33.5811 3.89467C33.3091 4.69011 32.7788 5.24519 31.9903 5.55991C31.4486 5.75267 30.899 5.77744 30.3413 5.63422C29.5305 5.39433 28.9524 4.8933 28.6068 4.13111C28.3343 3.46412 28.3297 2.79532 28.5932 2.12471C28.9392 1.33493 29.5311 0.820377 30.3687 0.581067C30.5407 0.538873 30.714 0.510725 30.8887 0.496622Z"
                                fill="#E84E27"
                            />
                            <path
                                opacity="0.999"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M63.3682 0.949244C65.6557 0.949244 67.9433 0.949244 70.2308 0.949244C70.2308 9.76072 70.2308 18.5723 70.2308 27.3837C71.2639 27.5576 72.2971 27.7333 73.3303 27.9107C73.3371 28.7011 73.3392 29.4915 73.3371 30.2819C70.0139 30.2819 66.6912 30.2819 63.3682 30.2819C63.3659 29.4915 63.3682 28.7011 63.375 27.9107C64.4077 27.7329 65.4409 27.5572 66.4745 27.3837C66.4767 19.5451 66.4745 11.7063 66.4676 3.86764C65.4349 3.68982 64.4017 3.51417 63.3682 3.34071C63.3682 2.54355 63.3682 1.7464 63.3682 0.949244Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.999"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M-0.00341797 2.89484C4.0129 2.89372 8.02921 2.89484 12.0455 2.89822C12.9505 2.89784 13.8491 2.97215 14.7413 3.12115C15.6558 3.27504 16.534 3.54301 17.3755 3.92507C18.0005 4.21642 18.573 4.58347 19.0929 5.02622C19.9241 5.76449 20.5046 6.66411 20.8342 7.72507C21.0243 8.34894 21.1383 8.98619 21.1763 9.63689C21.3424 11.3138 20.8429 12.7594 19.6779 13.974C19.016 14.6482 18.2463 15.1696 17.3687 15.5379C17.2319 15.5937 17.0951 15.6489 16.9582 15.7034C17.5764 15.8336 18.1671 16.0397 18.7303 16.3215C19.5695 16.7671 20.2799 17.365 20.8616 18.1151C21.7179 19.2415 22.1969 20.5116 22.2984 21.9252C22.358 22.7998 22.301 23.6667 22.1274 24.5261C21.7223 26.4244 20.6857 27.8758 19.0176 28.8801C18.1717 29.3808 17.2662 29.7389 16.3013 29.9542C15.4745 30.1382 14.6375 30.244 13.7903 30.2717C9.19244 30.2818 4.59452 30.2852 -0.00341797 30.2819C-0.00341797 29.4915 -0.00341797 28.7011 -0.00341797 27.9107C1.0317 27.7336 2.06714 27.558 3.1029 27.3837C3.10404 20.1958 3.1029 13.0079 3.09948 5.82C2.0657 5.64256 1.03141 5.46692 -0.00341797 5.29307C-0.00341797 4.49366 -0.00341797 3.69425 -0.00341797 2.89484ZM6.85921 5.82C8.67921 5.81887 10.4992 5.82 12.3192 5.82338C13.074 5.83658 13.8129 5.94917 14.5361 6.16115C16.3983 6.75293 17.3642 8.01731 17.4337 9.9544C17.4636 10.5267 17.4043 11.0897 17.2558 11.6433C16.9711 12.6086 16.3975 13.3551 15.535 13.8828C14.9603 14.2183 14.3399 14.4232 13.674 14.4975C13.5352 14.5136 13.3961 14.5249 13.2566 14.5313C11.1242 14.5413 8.99169 14.5447 6.85921 14.5414C6.85921 11.6343 6.85921 8.72712 6.85921 5.82ZM6.85921 17.4396C9.26312 17.4363 11.667 17.4397 14.0708 17.4497C14.6031 17.4675 15.1231 17.5553 15.6308 17.7132C16.8635 18.1287 17.704 18.9404 18.1521 20.1485C18.3723 20.7627 18.4978 21.3955 18.5284 22.0468C18.5743 22.6786 18.5332 23.3046 18.4053 23.9249C18.0706 25.3361 17.2301 26.328 15.884 26.9007C15.2951 27.1361 14.6838 27.2825 14.0503 27.3398C13.8022 27.3629 13.5536 27.3764 13.3045 27.3804C11.1561 27.3837 9.00763 27.3849 6.85921 27.3837C6.85921 24.069 6.85921 20.7543 6.85921 17.4396Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.998"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M129.997 29.9508C129.997 29.9621 129.997 29.9733 129.997 29.9846C128.682 30.3552 127.341 30.5613 125.974 30.6028C125.287 30.627 124.614 30.5437 123.955 30.3528C123.186 30.1145 122.53 29.7036 121.988 29.1199C121.623 28.6976 121.352 28.2201 121.174 27.6877C120.946 26.9756 120.823 26.246 120.804 25.4989C120.794 21.2272 120.791 16.9555 120.794 12.6837C119.708 12.6837 118.623 12.6837 117.537 12.6837C117.537 11.7671 117.537 10.8507 117.537 9.93414C118.623 9.93414 119.708 9.93414 120.794 9.93414C120.794 8.29707 120.794 6.65994 120.794 5.02285C122.046 5.02285 123.298 5.02285 124.55 5.02285C124.55 6.65994 124.55 8.29707 124.55 9.93414C126.044 9.93414 127.538 9.93414 129.032 9.93414C129.032 10.8507 129.032 11.7671 129.032 12.6837C127.538 12.6837 126.044 12.6837 124.55 12.6837C124.549 16.8473 124.55 21.011 124.554 25.1747C124.556 25.6022 124.617 26.021 124.739 26.4312C124.848 26.7911 125.036 27.1029 125.303 27.3668C125.668 27.6945 126.099 27.8679 126.596 27.887C127.142 27.8932 127.685 27.8527 128.225 27.7654C128.645 27.7014 129.065 27.6316 129.484 27.556C129.655 28.355 129.826 29.1533 129.997 29.9508Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.998"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M49.6292 38.4966C49.3624 38.4966 49.0955 38.4966 48.8287 38.4966C47.2946 38.4173 45.803 38.1234 44.3539 37.615C43.877 37.4438 43.414 37.2411 42.965 37.007C42.9577 37.002 42.9531 36.9953 42.9513 36.9868C43.2727 36.0281 43.5954 35.07 43.9195 34.1123C44.5973 34.4519 45.3031 34.721 46.0371 34.9196C47.0633 35.2105 48.1101 35.3625 49.1776 35.3756C49.771 35.3798 50.3549 35.3089 50.9292 35.1628C51.5581 34.9987 52.11 34.7015 52.585 34.271C53.0338 33.8276 53.3703 33.3108 53.5942 32.7206C53.7791 32.2242 53.9023 31.713 53.9637 31.1871C53.995 30.9177 54.0155 30.6475 54.0253 30.3764C54.0298 29.6176 54.0298 28.8587 54.0253 28.0998C52.8683 29.5501 51.3551 30.3889 49.4855 30.6163C48.4267 30.7419 47.3776 30.6879 46.3382 30.4541C45.1384 30.1604 44.087 29.6041 43.1839 28.7855C42.556 28.2042 42.0349 27.5432 41.6205 26.8028C41.0758 25.8062 40.6994 24.7501 40.4916 23.6344C40.3103 22.6494 40.2294 21.6563 40.2487 20.6552C40.2284 19.3891 40.3413 18.1348 40.5874 16.8924C40.8065 15.7906 41.1714 14.739 41.6821 13.7375C42.1261 12.8756 42.702 12.1088 43.4097 11.4372C44.5563 10.3739 45.9178 9.76139 47.4945 9.59973C48.4456 9.50097 49.3875 9.55501 50.3203 9.76187C51.7647 10.1092 52.9564 10.8467 53.8953 11.9743C54.028 12.1396 54.1557 12.3084 54.2784 12.481C54.393 11.6322 54.5059 10.7832 54.6171 9.93413C56.5238 9.93413 58.4304 9.93413 60.3371 9.93413C60.3394 10.7245 60.3371 11.5149 60.3303 12.3053C59.4845 12.4872 58.6383 12.6674 57.7918 12.8458C57.7952 18.7119 57.7918 24.5779 57.7816 30.444C57.7591 31.4062 57.6062 32.3474 57.3232 33.2678C56.9462 34.4735 56.3042 35.515 55.3971 36.3923C54.5215 37.1964 53.5043 37.7638 52.3455 38.0947C51.7429 38.2655 51.1294 38.3804 50.505 38.4392C50.2124 38.4651 49.9205 38.4843 49.6292 38.4966ZM49.2392 12.5688C49.8475 12.5563 50.4427 12.6363 51.025 12.8086C51.5976 12.9876 52.113 13.2646 52.5713 13.6396C53.1686 14.1297 53.6533 14.7096 54.0253 15.3791C54.0298 18.5069 54.0298 21.6348 54.0253 24.7626C53.6523 25.4711 53.1585 26.087 52.5439 26.6102C51.8398 27.1783 51.0324 27.5138 50.1218 27.6168C49.42 27.6993 48.7221 27.6745 48.0282 27.5425C46.8022 27.293 45.8546 26.6501 45.1853 25.6138C44.7994 25.0003 44.5143 24.3428 44.33 23.6412C44.1333 22.8627 44.0261 22.0723 44.0084 21.27C43.9854 20.4782 44.0082 19.6878 44.0768 18.8988C44.1495 18.1121 44.2978 17.3396 44.5216 16.5816C44.7495 15.8163 45.0939 15.1092 45.5547 14.4604C45.8678 14.0387 46.2361 13.6705 46.6597 13.3558C47.338 12.8944 48.0906 12.6376 48.9176 12.5857C49.0259 12.5806 49.1332 12.5749 49.2392 12.5688Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.998"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M85.475 9.55576C86.2934 9.53259 87.1076 9.57873 87.9177 9.69425C88.6908 9.80693 89.4366 10.0141 90.1551 10.3158C92.3787 11.2994 93.6254 12.9917 93.8943 15.3926C93.9196 15.6307 93.9353 15.8694 93.9422 16.1087C93.9442 19.6553 93.9469 23.202 93.949 26.7486C93.9517 27.0623 93.9675 27.3754 93.9969 27.6877C93.9996 27.6939 94.003 27.6995 94.0072 27.7046C94.6708 27.7724 95.3345 27.841 95.9982 27.9106C95.9982 28.701 95.9982 29.4914 95.9982 30.2818C94.2008 30.283 92.404 30.2818 90.6066 30.2784C90.4034 29.3594 90.2673 28.4305 90.1995 27.4918C89.2471 28.6778 88.0668 29.5706 86.6587 30.1703C85.7022 30.5542 84.708 30.7231 83.6756 30.677C82.9387 30.6632 82.2134 30.5663 81.4998 30.3865C80.7355 30.1894 80.0424 29.8561 79.4198 29.3867C78.5522 28.6861 77.9741 27.7977 77.6853 26.7216C77.4883 25.9566 77.4109 25.1797 77.4527 24.391C77.5389 22.8617 78.1472 21.5793 79.2761 20.5437C79.9104 19.9892 80.6219 19.5501 81.4108 19.2263C82.3037 18.8607 83.2295 18.6153 84.1887 18.49C84.8812 18.3971 85.577 18.3476 86.2756 18.3414C87.5776 18.338 88.8804 18.3368 90.1824 18.338C90.1838 17.6174 90.1824 16.8968 90.179 16.1762C90.1694 15.6054 90.0511 15.0582 89.8232 14.5346C89.4565 13.7785 88.8852 13.2301 88.1093 12.8896C87.6337 12.6907 87.1391 12.5668 86.6245 12.5181C85.8774 12.4505 85.1336 12.4775 84.394 12.5991C83.4847 12.7711 82.6527 13.1168 81.8966 13.6361C81.7557 14.5851 81.6209 15.5354 81.4929 16.487C80.5234 16.487 79.5546 16.487 78.5851 16.487C78.5837 14.9287 78.5851 13.3704 78.5885 11.8121C79.493 11.1026 80.4974 10.5656 81.6024 10.2009C82.6657 9.85639 83.7556 9.65142 84.8729 9.58616C85.0748 9.57448 85.2753 9.56434 85.475 9.55576ZM86.3782 20.8781C87.6461 20.8781 88.9146 20.8781 90.1824 20.8781C90.1838 22.1076 90.1824 23.3371 90.179 24.5666C89.8725 25.1193 89.4722 25.5978 88.9782 26.0022C87.4086 27.258 85.616 27.7579 83.6003 27.5019C83.2281 27.4491 82.8723 27.3433 82.5329 27.1844C81.8179 26.8147 81.3924 26.2348 81.2569 25.4448C81.1036 24.5155 81.2932 23.6621 81.8248 22.8845C82.1087 22.48 82.4474 22.1254 82.8408 21.8205C83.3841 21.4408 83.9842 21.1841 84.6403 21.0503C85.2144 20.9348 85.7939 20.8774 86.3782 20.8781Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.999"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M111.886 9.55583C112.688 9.54117 113.474 9.64027 114.246 9.85307C114.08 11.0012 113.916 12.1497 113.754 13.2984C112.776 13.2444 111.799 13.1925 110.822 13.143C110.191 13.1347 109.596 13.2754 109.039 13.5653C108.436 13.9244 107.943 14.3963 107.558 14.9805C107.377 15.2558 107.221 15.5463 107.093 15.852C107.089 19.6959 107.088 23.5398 107.089 27.3837C108.12 27.5579 109.152 27.7335 110.182 27.9107C110.189 28.7011 110.191 29.4915 110.189 30.2819C106.866 30.2819 103.543 30.2819 100.22 30.2819C100.218 29.4915 100.22 28.7011 100.227 27.9107C101.259 27.7329 102.292 27.5572 103.326 27.3837C103.326 22.54 103.326 17.6963 103.326 12.8525C102.291 12.6769 101.255 12.5013 100.22 12.3256C100.22 11.5285 100.22 10.7313 100.22 9.93414C102.375 9.93414 104.53 9.93414 106.686 9.93414C106.807 10.9115 106.93 11.8889 107.052 12.8661C107.453 12.1381 107.963 11.4907 108.581 10.9238C108.987 10.5586 109.439 10.2568 109.936 10.0186C110.556 9.73992 111.206 9.58569 111.886 9.55583Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                            <path
                                opacity="0.999"
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M26.2566 9.93414C28.5464 9.93414 30.8362 9.93414 33.1261 9.93414C33.1261 15.7507 33.1261 21.5672 33.1261 27.3837C34.1596 27.5576 35.1927 27.7333 36.2255 27.9107C36.2324 28.7011 36.2346 29.4915 36.2324 30.2819C32.9071 30.2819 29.5818 30.2819 26.2566 30.2819C26.2543 29.4915 26.2566 28.7011 26.2634 27.9107C27.2964 27.7343 28.3296 27.5586 29.3629 27.3837C29.3652 22.54 29.3629 17.6963 29.3561 12.8525C28.3232 12.6751 27.2901 12.4995 26.2566 12.3256C26.2566 11.5284 26.2566 10.7313 26.2566 9.93414Z"
                                :fill="isHome && !isScroll ? 'white' : '#2B2A29'"
                            />
                        </g>
                        <defs>
                            <clipPath id="clip0_1089_541">
                                <rect width="130" height="38" fill="white" transform="translate(0 0.5)" />
                            </clipPath>
                        </defs>
                    </svg>
                </Link>
                <div class="menu">
                    <Menubar :model="headerMenuItems" :class="isHome && !isScroll ? 'headerHome' : ''">
                        <template #item="{ item, props, hasSubmenu, root }">
                            <Link class="p-menubar-item-link" :href="item.url" v-bind="props.action" v-if="!hasSubmenu">
                                <span class="p-menubar-item-label">{{ item.label }}</span>
                            </Link>

                            <a class="p-menubar-item-link" v-bind="props.action" v-if="hasSubmenu">
                                <span class="p-menubar-item-label">{{ item.label }}</span>
                                <svg
                                    width="14"
                                    height="14"
                                    viewBox="0 0 14 14"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                    class="p-icon p-menubar-submenu-icon"
                                    aria-hidden="true"
                                    data-pc-section="submenuicon"
                                >
                                    <path
                                        d="M3.58659 4.5007C3.68513 4.50023 3.78277 4.51945 3.87379 4.55723C3.9648 4.59501 4.04735 4.65058 4.11659 4.7207L7.11659 7.7207L10.1166 4.7207C10.2619 4.65055 10.4259 4.62911 10.5843 4.65956C10.7427 4.69002 10.8871 4.77074 10.996 4.88976C11.1049 5.00877 11.1726 5.15973 11.1889 5.32022C11.2052 5.48072 11.1693 5.6422 11.0866 5.7807L7.58659 9.2807C7.44597 9.42115 7.25534 9.50004 7.05659 9.50004C6.85784 9.50004 6.66722 9.42115 6.52659 9.2807L3.02659 5.7807C2.88614 5.64007 2.80725 5.44945 2.80725 5.2507C2.80725 5.05195 2.88614 4.86132 3.02659 4.7207C3.09932 4.64685 3.18675 4.58911 3.28322 4.55121C3.37969 4.51331 3.48305 4.4961 3.58659 4.5007Z"
                                        fill="currentColor"
                                    ></path>
                                </svg>
                            </a>
                        </template>
                    </Menubar>
                </div>
            </div>
            <div class="right">
                <div class="search">
                    <Link :href="route('main.search.index')" :class="'p-button lightgrey' + (isHome && !isScroll ? ' translucent whiteText' : '')">
                        <span class="p-button-icon material-symbols-outlined">search</span>
                    </Link>
                </div>
                <div class="user">
                    <Link :href="route('user.favorites.index')" class="p-button grey" v-if="User">
                        <span class="p-button-icon material-symbols-outlined">favorite</span>
                    </Link>
                    <Link :href="route('user.notifications.index')" class="p-button pearl" aria-label="Уведомления" v-if="User">
                        <span class="p-button-icon material-symbols-outlined">notifications_active</span>
                    </Link>
                    <Button @click="toggleUserMenu" class="nostyle" aria-haspopup="true" aria-controls="user_menu" v-if="User">
                        <template #default>
                            <Avatar :image="User.personal.avatar" shape="circle" class="buttonAvatar" />
                        </template>
                    </Button>
                    <Menu ref="userMenu" id="user_menu" :model="userMenuItems" :popup="true">
                        <template #item="{ item, props }">
                            <Link :href="item.url">
                                <Avatar :image="User.personal.avatar" shape="circle" v-if="item.avatar" class="avatar" />
                                <i class="p-button-icon material-symbols-outlined" v-if="item.icon">{{ item.icon }}</i>
                                <span>{{ item.label }}</span>
                            </Link>
                        </template>
                        <template #end>
                            <Link :href="route('auth.logout.index')">
                                <i class="p-button-icon material-symbols-outlined">logout</i>
                                <span>Выйти из аккаунта</span>
                            </Link>
                        </template>
                    </Menu>
                    <Button @click="router.visit(route('auth.login.index'))" class="orange" label="Войти" v-if="!User">
                        <template #icon>
                            <span class="p-button-icon material-symbols-outlined">account_circle</span>
                        </template>
                    </Button>
                </div>
            </div>
        </div>
    </header>
</template>

<style lang="scss">
header {
    position: fixed;
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 100%;
    background: rgba(255, 255, 255, 1);
    z-index: 10;

    &.headerHome {
        background: linear-gradient(360deg, rgba(0, 0, 0, 0) 0%, rgba(0, 0, 0, 0) 100%);
    }

    .main {
        display: flex;
        align-items: center;
        justify-content: space-between;
        gap: 20px;
        width: 1520px;
        padding: 22px 0;

        .left {
            display: flex;
            align-items: center;
            gap: 70px;
        }

        .right {
            display: flex;
            align-items: center;
            gap: 24px;

            .user {
                display: flex;
                align-items: center;
                gap: 10px;

                .buttonAvatar {
                    width: 54px;
                    height: 54px;

                    img {
                        border-radius: 15px;
                    }
                }
            }
        }
    }
}
</style>
