<script setup lang="ts">


import { Link } from '@inertiajs/vue3';
</script>

<template>
    <Accordion value="0">
        <template #collapseicon>
            <i class="p-button-icon material-symbols-outlined">close</i>
        </template>
        <template #expandicon>
            <i class="p-button-icon material-symbols-outlined">add</i>
        </template>
        <AccordionPanel value="0">
            <AccordionHeader>Проходят ли специалисты проверку?</AccordionHeader>
            <AccordionContent>Да. Каждый кандидат заполняет расширенный профиль и загружает сканы дипломов, лицензий и удостоверений личности. Эти документы вручную сверяет модератор-эксперт, после чего аккаунт получает отметку «Верифицирован». Без подтверждения консультант не виден клиентам и не может отвечать на вопросы. Повторная проверка проводится при истечении срока действия лицензий или по жалобе пользователя.</AccordionContent>
        </AccordionPanel>
        <AccordionPanel value="1">
            <AccordionHeader>Сколько времени специалисты отвечают на публичный вопрос?</AccordionHeader>
            <AccordionContent>Да. Каждый кандидат заполняет расширенный профиль и загружает сканы дипломов, лицензий и удостоверений личности. Эти документы вручную сверяет модератор-эксперт, после чего аккаунт получает отметку «Верифицирован». Без подтверждения консультант не виден клиентам и не может отвечать на вопросы. Повторная проверка проводится при истечении срока действия лицензий или по жалобе пользователя.</AccordionContent>
        </AccordionPanel>
        <AccordionPanel value="2">
            <AccordionHeader>Можно ли задать вопрос анонимно?</AccordionHeader>
            <AccordionContent>Да. Каждый кандидат заполняет расширенный профиль и загружает сканы дипломов, лицензий и удостоверений личности. Эти документы вручную сверяет модератор-эксперт, после чего аккаунт получает отметку «Верифицирован». Без подтверждения консультант не виден клиентам и не может отвечать на вопросы. Повторная проверка проводится при истечении срока действия лицензий или по жалобе пользователя.</AccordionContent>
        </AccordionPanel>
        <AccordionPanel value="3">
            <AccordionHeader>Как установить стоимость своей консультации?</AccordionHeader>
            <AccordionContent>Да. Каждый кандидат заполняет расширенный профиль и загружает сканы дипломов, лицензий и удостоверений личности. Эти документы вручную сверяет модератор-эксперт, после чего аккаунт получает отметку «Верифицирован». Без подтверждения консультант не виден клиентам и не может отвечать на вопросы. Повторная проверка проводится при истечении срока действия лицензий или по жалобе пользователя.</AccordionContent>
        </AccordionPanel>
        <AccordionPanel value="4">
            <AccordionHeader>Что делать, если ответ специалиста не помог?</AccordionHeader>
            <AccordionContent>Да. Каждый кандидат заполняет расширенный профиль и загружает сканы дипломов, лицензий и удостоверений личности. Эти документы вручную сверяет модератор-эксперт, после чего аккаунт получает отметку «Верифицирован». Без подтверждения консультант не виден клиентам и не может отвечать на вопросы. Повторная проверка проводится при истечении срока действия лицензий или по жалобе пользователя.</AccordionContent>
        </AccordionPanel>
    </Accordion>
</template>

<style lang="scss">

</style>
